Tekla Open API Reference for Tekla Structures 2025
RadiusDimension.GetDimensionSet Method
Overload List
Name | Description
GetDimensionSet()
 Radius dimensions don't have dimension sets.
 (Overrides DimensionBase.GetDimensionSet().)
GetDimensionSet(Boolean)
 Radius dimensions don't have dimension sets.
 (Overrides DimensionBase.GetDimensionSet(Boolean).)
Top
See Also
Reference
RadiusDimension Class
Tekla.Structures.Drawing Namespace